app/controllers/chat_sessions_controller.rb

  def index
    chat_sessions = @user.chat_sessions
    if chat_session_index_params.has_key? :chat_peers
      chat_sessions = chat_sessions.joins(:users).where("users.id" => chat_session_index_params[:chat_peers].split(","))
---
SELECT "chat_sessions".* FROM "chat_sessions" INNER JOIN "chat_sessions_users" ON "chat_sessions"."id" = "chat_sessions_users"."chat_session_id" INNER JOIN "chat_sessions_users" "chatsessions_users_chat_sessions_join" ON "chatsessions_users_chat_sessions_join"."chat_session_id" = "chat_sessions"."id" INNER JOIN "users" ON "users"."id" = "chatsessions_users_chat_sessions_join"."user_id" WHERE "chat_sessions_users"."user_id" = $1 AND "users"."id" = $2  [["user_id", 2], ["id", 3]]

    def set_user
      @user = nil
      if params.has_key? :user_id
        @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]